// Знакомство с языками программирования (семинары)
// Урок 1. Знакомство с языком программирования С#

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

Console.Clear();

Console.Write("Введите первое число: ");
float x1 = float.Parse(Console.ReadLine());

Console.Write("Введите второе число: ");
float x2 = float.Parse(Console.ReadLine());